Revit 2026 API

# ExternalServicesBuiltInExternalServicesElectricalAnalyticalLoadSetUIService Property

---

The UI service which permits registration of an external server for UI managing Electrical Analytical Load Set.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ExternalServiceId ElectricalAnalyticalLoadSetUIService { get; }
```
```vb
Public Shared ReadOnly Property ElectricalAnalyticalLoadSetUIService As ExternalServiceId
	Get
```
```cpp
public:
static property ExternalServiceId^ ElectricalAnalyticalLoadSetUIService {
	ExternalServiceId^ get ();
}
```
```fsharp
static member ElectricalAnalyticalLoadSetUIService : ExternalServiceId with get
```

#### Property Value

ExternalServiceId

#### Reference

ExternalServicesBuiltInExternalServices Class

Autodesk.Revit.DB.ExternalService Namespace